taylorCouetteGym/taylor_couette_mixing/cases/side_outlet_cat_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     pimpleFoam;

// latestTime (NOT startTime): the RL env / sweep step pimpleFoam forward in
// chunks, CONTINUING from the last written time dir (they only bump endTime).
// See the step-loop contract memory.
startFrom       latestTime;
startTime       0;

stopAt          endTime;
endTime         2;          // placeholder; the env/sweep set this each step

deltaT          1e-3;
adjustTimeStep  yes;
maxCo           1.5;
maxDeltaT       0.05;

writeControl    adjustableRunTime;
writeInterval   1;          // one field dir per simulated second (env step boundary);
                            // adjustableRunTime nudges dt to land exactly on integer
                            // seconds so _get_latest_time() stays on the step grid

purgeWrite      0;
writeFormat     ascii;
writePrecision  9;
writeCompression no;
timeFormat      general;
timePrecision   9;
runTimeModifiable no;

functions
{
    // ---- reactant transport (catalysis scalar C) ----------------------------
    scalarTransport
    {
        type            scalarTransport;
        libs            ( solverFunctionObjects );
        field           C;
        resetOnStartUp  false;
        schemesField    C;
        D               2.8e-8;     // must match transportProperties.D below
        nCorr           1;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
    }

    // ---- METRICS line for the env / hysteresis sweep ------------------------
    // Emits, every `executeInterval` steps:
    //   Mz_kin  : kinematic torque on the inner wall about z (env multiplies by
    //             rho to get N.m; mech power = rho*|Mz_kin|*omega)
    //   conv    : outlet conversion 1 - cupC, cup-mixing weighted by the face
    //             flux phi at the SIDE outlet (radial outflow -> weight by phi,
    //             not by axial velocity as a bottom outlet would)
    //   wallFlux: catalytic consumption rate at the outer wall, -D * dC/dn * dA
    rlMetrics
    {
        type            coded;
        libs            ( utilityFunctionObjects );
        name            rlMetrics;

        executeControl  timeStep;
        executeInterval 20;

        codeInclude
        #{
            #include "fvCFD.H"
        #};

        codeOptions
        #{
            -I$(LIB_SRC)/finiteVolume/lnInclude
        #};

        codeLibs
        #{
            -lfiniteVolume
        #};

        codeExecute
        #{
            const fvMesh& mesh = refCast<const fvMesh>(obr_);
            const Time& runTime = mesh.time();

            const volScalarField& C = mesh.lookupObject<volScalarField>("C");
            const volVectorField& U = mesh.lookupObject<volVectorField>("U");
            const surfaceScalarField& phi =
                mesh.lookupObject<surfaceScalarField>("phi");

            // transport properties (nu for the torque, D for the wall flux)
            IOdictionary transportProperties
            (
                IOobject
                (
                    "transportProperties",
                    runTime.constant(),
                    mesh,
                    IOobject::MUST_READ_IF_MODIFIED,
                    IOobject::NO_WRITE
                )
            );
            const scalar nu = dimensionedScalar("nu", dimViscosity, transportProperties).value();
            const scalar Dmol = dimensionedScalar("D", dimViscosity, transportProperties).value();

            // ---------- inner-wall kinematic torque about z ----------
            scalar Mz = 0.0;
            const label innerID = mesh.boundaryMesh().findPatchID("inner_wall");
            if (innerID >= 0)
            {
                const volTensorField gradU(fvc::grad(U));
                const fvPatchTensorField& gradUp = gradU.boundaryField()[innerID];
                const fvPatch& pIn = mesh.boundary()[innerID];
                const vectorField& Cf = pIn.Cf();
                const vectorField& Sf = pIn.Sf();
                forAll(Cf, i)
                {
                    const tensor g = gradUp[i];
                    // kinematic viscous traction * area  =  nu*(gradU + gradU^T) . Sf
                    const vector tr = nu*((g + g.T()) & Sf[i]);
                    Mz += (Cf[i] ^ tr).z();
                }
            }
            reduce(Mz, sumOp<scalar>());

            // ---------- side-outlet cup-mixing conversion (phi weighted) ----------
            scalar num = 0.0, den = 0.0;
            const label outID = mesh.boundaryMesh().findPatchID("side_outlet");
            if (outID >= 0)
            {
                const fvPatchScalarField& Cp = C.boundaryField()[outID];
                const fvsPatchScalarField& phip = phi.boundaryField()[outID];
                forAll(Cp, i)
                {
                    const scalar f = phip[i];
                    if (f > 0.0) { den += f; num += f*Cp[i]; }
                }
            }
            reduce(num, sumOp<scalar>());
            reduce(den, sumOp<scalar>());
            const scalar cupC = (den > VSMALL) ? num/den : 0.0;
            const scalar conv = 1.0 - cupC;   // feed c0 = 1

            // ---------- catalytic outer-wall consumption flux ----------
            scalar wallFlux = 0.0;
            const label outerID = mesh.boundaryMesh().findPatchID("outer_wall");
            if (outerID >= 0)
            {
                const scalarField snGradC(C.boundaryField()[outerID].snGrad());
                const scalarField magSf(mag(mesh.Sf().boundaryField()[outerID]));
                forAll(snGradC, i) wallFlux += -Dmol*snGradC[i]*magSf[i];
            }
            reduce(wallFlux, sumOp<scalar>());

            Info<< "METRICS t=" << runTime.value()
                << " Mz_kin=" << Mz
                << " conv=" << conv
                << " cupC=" << cupC
                << " wallFlux=" << wallFlux
                << endl;
        #};
    }
}

// ************************************************************************* //
