taylorCouetteGym/taylor_couette_mixing/cases/side_outlet_cat_case/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// side_outlet_cat_case: Yuhe's shortened side-outlet geometry, but with the
// env-standard SETTABLE inner-wall rotation (rotatingWallVelocity, omega entry).
// The RL env / hysteresis sweep set boundaryField.inner_wall.omega via
// foamDictionary (scalar for constant, or a Function1 `table (...)` for a ramp).
// Top-face inlet keeps Yuhe's fully-developed annular inflow; closed bottom face;
// bottom outer-wall side outlet.

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inner_wall
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           0;          // rad/s; set by the env / sweep (foamDictionary)
    }

    outer_wall
    {
        type            noSlip;
    }

    bottom
    {
        type            noSlip;
    }

    inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            lopezFullyDevelopedAnnularTopInlet;

        code
        #{
            const fvPatch& p = patch();
            vectorField Uin(p.size(), vector::zero);

            const vectorField& Cf = p.Cf();
            const vectorField& Sf = p.Sf();

            const scalar Ri = 0.0254;
            const scalar Ro = 0.03175;
            const scalar Q0 = 40e-6/60.0;   // full 360-degree flow rate [m3/s]
            const scalar pi = 3.1415926535897932384626433832795;

            const scalar Aann = pi*(sqr(Ro) - sqr(Ri));
            const scalar Umean = Q0/Aann;

            scalarField shape(p.size(), scalar(0));
            scalar sumShapeA = scalar(0);
            scalar sumA = scalar(0);

            forAll(Cf, faceI)
            {
                const scalar r = sqrt(sqr(Cf[faceI].x()) + sqr(Cf[faceI].y()));

                scalar f =
                    sqr(Ro) - sqr(r)
                  - (sqr(Ro) - sqr(Ri))/log(Ro/Ri)*log(Ro/r);

                shape[faceI] = max(f, scalar(0));

                const scalar Af = mag(Sf[faceI]);
                sumShapeA += shape[faceI]*Af;
                sumA      += Af;
            }

            reduce(sumShapeA, sumOp<scalar>());
            reduce(sumA, sumOp<scalar>());

            const scalar meanShape = sumShapeA/max(sumA, VSMALL);
            const scalar scale = Umean/max(meanShape, VSMALL);

            forAll(Cf, faceI)
            {
                const vector nHat = Sf[faceI]/mag(Sf[faceI]);
                // Top inlet outward normal points +z; inflow is opposite to it.
                Uin[faceI] = -scale*shape[faceI]*nHat;
            }

            operator==(Uin);
        #};
    }

    side_outlet
    {
        type            zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
